<!-- dflook/terraform-github-actions {"workspace":"fix-no-state","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"a70ca46dc7b35eb4997f869c859d0a5a8614101c46a3f7ebc2a4c0d9f3b404ba","plan_job_ref":"Job Test plan target and replace #354 at https://github.com/dflook/terraform-github-actions/actions/runs/5662408215","plan_hash":"aa2a436b275f2661e310e7673c1fabbcf2e8df20e05d13e6a9b2ac274042c063","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-no-state__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "UgDQwLqNcq" -> (known after apply)
  ~ foreach = "T1ugRtpkUc" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #354](https://github.com/dflook/terraform-github-actions/actions/runs/5662408215)